# Реализовать генератор с помощью функции с ключевым словом yield, создающим очередное значение.
# При вызове функции должен создаваться объект-генератор.
# Функция должна вызываться следующим образом: for el in fibo_gen().
# Функция отвечает за получение факториала числа, а в цикле необходимо выводить только первые 15 чисел.
# Подсказка: факториал числа n — произведение чисел от 1 до n. Например, факториал четырёх 4! = 1 * 2 * 3 * 4 = 24.

def fibo_gen(number):
    count = 1
    while count <= number:
        yield count
        count += 1
i = 1
my_nambers = []
for el in fibo_gen(5):
    if i > 15:
        break
    else:
        my_nambers.append(el)
        i += 1
print(my_nambers)